acpi
alacritty
amd-ucode
arandr
arc-gtk-theme
arc-icon-theme
base
base-devel
bat
blueman
bluez-utils
brightnessctl
cmake
composer
dbeaver
docker
docker-compose
dotnet-runtime
dotnet-sdk
dunst
efibootmgr
fd
fish
fzf
git
grim
grub
gst-plugin-pipewire
htop
imv
inotify-tools
kanshi
keepassxc
lazygit
less
libpulse
libreoffice-fresh
linux
linux-firmware
linux-headers
lxappearance
mariadb
mpd
mplayer
neofetch
neovim
noto-fonts-cjk
noto-fonts-emoji
npm
obsidian
obsidian-icon-theme
papirus-icon-theme
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
playerctl
pulsemixer
python-iwlib
python-poetry
python-pywlroots
qbittorrent
qtile
ripgrep
rofi
sddm
sddm-kcm
slurp
smartmontools
speedtest-cli
starship
swayidle
sysstat
telegram-desktop
thunar
tmux
translate-shell
tree
ttf-firacode-nerd
ttf-font-awesome
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
unzip
vlc
wget
wireless_tools
wireplumber
wl-clipboard
wlroots
xcape
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-wlr
xdg-utils
xorg-xev
xorg-xinit
xorg-xrandr
xorg-xrdb
xorg-xsetroot
xorg-xwayland
xssstate
xxkb
zip
firefox
fprintd
