acpi
amd-ucode
arc-gtk-theme
arc-icon-theme
blueman
bluez-utils
brightnessctl
dbeaver
docker
dunst
fd
fish
fzf
git
grim
gst-plugin-pipewire
htop
imv
lazygit
less
mariadb
mpd
neofetch
neovim
noto-fonts-cjk
noto-fonts-emoji
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
playerctl
pulsemixer
python-iwlib
python-poetry
python-pywlroots
qbittorrent
ripgrep
wofi
sddm
sddm-kcm
speedtest-cli
starship
telegram-desktop
thunar
ttf-firacode-nerd
ttf-font-awesome
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
unzip
wget
wireless_tools
wireplumber
wl-clipboard
wlroots
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-wlr
xdg-utils
xorg-xev
xorg-xsetroot
xorg-xwayland
xssstate
xxkb
zip
firefox
imagemagick
jq
ncspot
easyeffects
foot
